;(2007/09/09)
; HSP HELP Browser II用 HELPソースファイル
;
;Forsythia3D
;

%type
Forsythia3D命令
%ver
1.0.0.0
%note
forsythia.asをインクルードすること。
実行ファイル作成後は forsythia.hpiが必要。
%date
2019/07/14
%author
MIA
%dll
Forsythia3D
%url
http://diry.net/mia

;-----------------------------------------------------------------------------------------

%index
fr_init
Forsythia3Dの初期化

%group
初期化系

%prm

%inst
screen/bgscr で作られた画面に対して初期化を行います。
Forsythia で使用できるのは、１つの画面だけです。
画面はパレット・フルカラーのどちらで作成されていても構いません。
すべての命令の前に実行しないとシステムエラーが発生します。

;-----------------------------------------------------------------------------------------

%index
fr_begin
描写の開始

%group
描写系

%prm

%inst
描写を開始します
fr_draw / frp_draw を呼び出す前に実行してください。

;-----------------------------------------------------------------------------------------

%index
fr_end
描写の終了と画面の更新

%group
描写系

%prm

%inst
描画を終了し、画面を更新します。
redraw 命令と同じようなものです。

;-----------------------------------------------------------------------------------------

%index
fr_load
Ｘファイルの読み込み

%group
オブジェクト系

%prm
p1,p2
p1 : 読み込むＸファイルの名前
p2 : オブジェクト番号

%inst
モデル番号 p2 に、X ファイルを読み込みます。

;-----------------------------------------------------------------------------------------

%index
fr_draw
オブジェクトの描画
%group
描写系

%prm
p1
p1 : 描画するオブジェクト番号

%inst
p1 番のオブジェクトを描画します。

;-----------------------------------------------------------------------------------------

%index
fr_addlight
ライトの追加

%group
ライト系

%prm
p1,p2
p1 : ライト番号
p2 : 光源の種類

%inst
ライト p1 を追加します。
ライトが一つもない場合、全てのモデルは真っ黒に表示されます。
p2 には、光源の種類を指定します。
	1 (D3DLIGHT_POINT)       : 点光源
	2 (D3DLIGHT_SPOT)        : スポットライト
	3 (D3DLIGHT_DIRECTIONAL) : 平行光源

;-----------------------------------------------------------------------------------------

%index
fr_setlightparam
ライトのパラメータを設定

%group
ライト系

%prm
p1,p2
p1 : ライトのパラメータ（数値型配列変数）
p2 : ライト番号

%inst
ライトのパラメータを一括設定します。
p1は数値型の配列で、以下のような意味を持ちます。
p1 = 色R, G, B, スペキュラ色R, G, B, 位置X, Y, Z, 向きX, Y, Z, 減衰率1, 2, 3

;-----------------------------------------------------------------------------------------

%index
fr_setambient
環境光の設定

%group
ライト系

%prm
r,g,b
r,g,b : 環境光の色

%inst
環境光を設定します。オブジェクト側のマテリアルに
環境光が設定されていない場合は、ここで値を設定しても効果はありません。

;-----------------------------------------------------------------------------------------

%index
fr_setposture
オブジェクトの姿勢変更

%group
オブジェクト系

%prm
p1,p2
p1 : 姿勢のパラメータ
p2 : オブジェクト番号

%inst
オブジェクトの姿勢を設定します。
p1は数値型の配列で、以下のような意味を持ちます。
p1 = 位置X, Y, Z, 回転X, Y, Z, スケールX, Y, Z, モーション時刻

;-----------------------------------------------------------------------------------------

%index
fr_setcampos

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setcamtarget

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setobjcolor

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_free

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_loadtex

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_freetex

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_settex

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setlightcol

%group


%prm

%inst

;-----------------------------------------------------------------------------------------

%index
fr_setlightspq

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setlightpos
ライトの位置を設定
%group
ライト系

%prm
p1,p2,p3,p4
p1 : ライト番号

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setlightdir

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setlightatt

%group


%prm

%inst

;-----------------------------------------------------------------------------------------

%index
fr_removelight

%group


%prm

%inst

;-----------------------------------------------------------------------------------------

%index
fr_setcolor

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_bgcolor
背景色の設定

%group
描写系

%prm
r,g,b,a
r,g,b : 設定する色

%inst
画面の背景色を設定します。

;-----------------------------------------------------------------------------------------

%index
fr_setfont

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_mes

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setrs

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setcamup

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_settrackenable

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_settrackweight

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_getanimnum

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_getsintbl

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_getcostbl

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_intersect

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_intersectL

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_atan

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_len

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_proj

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_vecftow

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_getframeptr

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_getframename

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_vecltof

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
frp_add

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
frp_update

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
frp_draw

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_drawsprite

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_settss

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_getcapssize

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_getcaps

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_loadshader

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_selshader

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_seltech

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setshadertex

%group


%prm

%inst


;-----------------------------------------------------------------------------------------

%index
fr_setshaderarg

%group


%prm

%inst



%index


%group


%prm

%inst


;-----------------------------------------------------------------------------------------
